package sal.salad;

import java.util.Arrays;

public class Main {
    public static void main(String[] args) {
        Салат дивнийСалат = new Салат();
        дивнийСалат.додати(new Картопля("Солодка", 55));
        дивнийСалат.додати(new Помідор("Рожевий", 100));
        дивнийСалат.додати(new Огірок("Тепличний", 50));
        дивнийСалат.додати(new Помідор("Червоний", 25));

        System.out.println("Калорійність дивного салату: " + дивнийСалат.калорійність());
        System.out.println("Овочі відсортовані за калорійністю в зростаючому порядку: " + Arrays.toString(дивнийСалат.овочіЗаКалорійністю()));
        System.out.println("Овоч калорійність якого лежить між 30 і 60: " + дивнийСалат.знайтиЗаКалорійністю(30, 60));
    }
}
