package sal.salad;

import java.util.Arrays;

public class Салат {
    private static int МАКСИМАЛЬНА_КІЛЬКІСТЬ_ІНГРЕДІЄНТІВ = 10;
    public Овоч[] інгредієнти = new Овоч[МАКСИМАЛЬНА_КІЛЬКІСТЬ_ІНГРЕДІЄНТІВ];
    private int лічильник = 0;

    public void додати(Овоч овоч) {
        інгредієнти[лічильник++] = овоч;
    }

    public Овоч[] овочіЗаКалорійністю() {
        Овоч[] овочі = інгредієнти.clone();
        Овоч буфер;
        boolean відсортовано = false;
        while (!відсортовано) {
            відсортовано = true;
            for (int i = 1; i < лічильник; i++) {
                if (овочі[i - 1].калорійність > овочі[i].калорійність) {
                    буфер = овочі[i - 1];
                    овочі[i - 1] = овочі[i];
                    овочі[i] = буфер;
                    відсортовано = false;
                }
            }
        }
        return овочі;
    }

    public int калорійність() {
        int калорійність = 0;
        for (Овоч інгредієнт : інгредієнти) {
            if (інгредієнт != null) {
                калорійність += інгредієнт.калорійність;
            }
        }

        return калорійність;
    }

    public Овоч знайтиЗаКалорійністю(int min, int max) {
        Овоч знайдений = null;
        for (Овоч овоч : інгредієнти) {
            if (овоч != null) {
                if (овоч.калорійність >= min && овоч.калорійність <= max) {
                    знайдений = овоч;
                }
            }
        }

        return знайдений;
    }

    @Override
    public String toString() {
        return "Салат{" + "Інгредієнти=" + Arrays.toString(інгредієнти) + '}';
    }
}
